БИТУправление_медицинским_центром_демо/src/Catalogs/СтруктураПрайслистов/СтруктураПрайслистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПрайслистов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтруктураПрайслистов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.ЕдиницаИзмерения	= Ценообразование.ПолучитьЕдиницуПродажиНоменклатуры(Объект.Номенклатура, Объект.ЕдиницаИзмерения);
	Объект.Наименование		= СокрЛП(Объект.Номенклатура);
	Объект.НаименованиеПолное = СокрЛП(ОбщегоНазначенияРасширенный.ПолучитьПолноеНаименованиеОбъекта(Объект.Номенклатура));

КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	Если Объект.Наименование = СокрЛП(Объект.Номенклатура) Тогда
		Объект.Наименование = СокрЛП(Объект.Наименование) + " " + СокрЛП(Объект.Характеристика);
		Объект.НаименованиеПолное = СокрЛП(ОбщегоНазначенияРасширенный.ПолучитьПолноеНаименованиеОбъекта(Объект.Номенклатура)) + " " + СокрЛП(Объект.Характеристика);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
